# ####################################################################

#  Created by Encounter(R) RTL Compiler v11.10-s016_1 on Wed Oct 19 08:54:44 -0200 2016

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design RouterCC

create_clock -name "clock" -add -period 2.0 -waveform {0.0 1.0} [get_ports clock]
set_clock_gating_check -setup 0.0 
set_operating_conditions nom_1.00V_25C
set_wire_load_selection_group "default_by_area" -library "CORE65GPSVT"
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_BK1SX1]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_BK1X1]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPHQNX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPHQNX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPHQNX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPHQX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPHQX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPHQX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPQNX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPQNX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPQNX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPQX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPQX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPQX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPRQNX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPRQNX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPRQNX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPRQX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPRQX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPRQX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPSQNX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPSQNX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPSQNX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPSQX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPSQX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_DFPSQX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPBTQX9]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQNTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQNTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQNTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQNX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQNX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQNX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHQX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHRQNTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHRQNTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHRQNTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHRQTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHRQTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPHRQTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQNTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQNTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQNTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQNX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQNX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQNX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPQX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQNTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQNTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQNTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQNX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQNX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQNX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPRQX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQNTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQNTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQNTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQNX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQNX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQNX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQTX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQTX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQTX35]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQX18]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQX27]
set_dont_use [get_lib_cells CORE65GPSVT/HS65_GS_SDFPSQX35]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX10]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX14]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX17]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX21]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX24]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX27]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX31]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX34]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX38]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX41]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX52]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX62]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX7]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GSP_CNHLSX82]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CAPX18]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CAPX35]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CAPX53]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CAPX9]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_0]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_1]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_10]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_11]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_12]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_13]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_14]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_15]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_16]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_17]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_18]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_19]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_2]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_20]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_21]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_22]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_23]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_3]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_4]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_5]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_6]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_7]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_8]
set_dont_use [get_lib_cells CLOCK65GPSVT/HS65_GS_CNBFX38_9]
set_dont_use [get_lib_cells IO65LPHVT_SF_1V8_50A_7M4X0Y2Z/ANA_1V8_SF_2ROWS]
set_dont_use [get_lib_cells IO65LPHVT_SF_1V8_50A_7M4X0Y2Z/ANA_1V8_SF_LIN]
set_dont_use [get_lib_cells IO65LPHVT_SF_1V8_50A_7M4X0Y2Z/BD2SCARUDQP_1V8_SF_2ROWS]
set_dont_use [get_lib_cells IO65LPHVT_SF_1V8_50A_7M4X0Y2Z/BD2SCARUDQP_1V8_SF_LIN]
set_dont_use [get_lib_cells IO65LPHVT_SF_1V8_50A_7M4X0Y2Z/BD4SCARUDQP_1V8_SF_2ROWS]
set_dont_use [get_lib_cells IO65LPHVT_SF_1V8_50A_7M4X0Y2Z/BD4SCARUDQP_1V8_SF_LIN]
set_dont_use [get_lib_cells IO65LPHVT_SF_1V8_50A_7M4X0Y2Z/BD8SCARUDQP_1V8_SF_2ROWS]
set_dont_use [get_lib_cells IO65LPHVT_SF_1V8_50A_7M4X0Y2Z/BD8SCARUDQP_1V8_SF_LIN]
