#####################################################################
#
# First Encounter mode file
# Created by Encounter(R) RTL Compiler on 10/19/2016 08:54:45
#
#####################################################################


# General Mode Settings
###########################################################
setAnalysisMode -asyncChecks noAsync
set_global timing_apply_default_primary_input_assertion false
set_global timing_clock_phase_propagation both
setAnalysisMode -multipleClockPerRegister true
if {[info command getVersion] != ""} {
  set ver [getVersion]
  regexp \[0-9\]+ $ver enc_ver
  if {$enc_ver >= 10} {
    setOptMode -allEndPoints false
  }
}
setPlaceMode -reorderScan false
setExtractRCMode -engine preRoute
